{"Items":[{"Id":1,"Name":"Close a <span style=\"color: #6296da\">User Story</span> when all its <span style=\"color: #130c90\">Tasks</span> are done","Description":null,"IsEnabled":false},{"Id":2,"Name":"Close a <span style=\"color: #da5868\">Bug's</span> <span style=\"color: #6296da\">User Story</span> if all its <span style=\"color: #da5868\">Bugs</span> and <span style=\"color: #130c90\">Tasks</span> are closed","Description":"When a Bug is closed, check all the other Tasks and Bugs in its User Story. If they all have been closed, close the User Story as well.","IsEnabled":false},{"Id":3,"Name":"Close a <span style=\"color: #130c90\">Task's</span> <span style=\"color: #6296da\">User Story</span> if all its <span style=\"color: #130c90\">Tasks</span> and <span style=\"color: #da5868\">Bugs</span> are closed","Description":"When a Task is closed, check all the other Tasks and Bugs in its User Story. If they all have been closed, close the User Story as well.","IsEnabled":false},{"Id":4,"Name":"Start a <span style=\"color: #6296da\">User Story</span> when a <span style=\"color: #130c90\">Task</span> has been started","Description":"After the first Task in a User Story is moved to a state that's not Initial or Planned, move this User Story to the first state after Planned.","IsEnabled":false},{"Id":5,"Name":"Start a <span style=\"color: #268213\">Feature</span> when a <span style=\"color: #6296da\">User Story</span> has been started","Description":"After the first User Story in a Feature is moved to a state that's not Initial or Planned, move this Feature to the first state after Planned.","IsEnabled":false},{"Id":6,"Name":"Assign a <span style=\"color: #130c90\">Task</span> to the Person who started it","Description":"After the Task is moved from an Initial or Planned state to any other state, assign it to the Person who moved it. \"Developer\" role must be available in the Task workflow.","IsEnabled":true},{"Id":7,"Name":"Assign the people working on a <span style=\"color: #6296da\">User Story</span> to a newly created <span style=\"color: #130c90\">Task</span>","Description":"Everyone who is assigned to the parent User Story will be assigned to a new Task.","IsEnabled":false},{"Id":8,"Name":"Assign a <span style=\"color: #6296da\">User Story's</span> <span style=\"color: #268213\">Feature</span> to a <span style=\"color: #da5868\">Bug</span>","Description":"When a Bug is assigned to a User Story, also assign this Bug to User Story's Feature.","IsEnabled":true},{"Id":9,"Name":"Assign a <span style=\"color: #268213\">Feature's</span> Project to a <span style=\"color: #6296da\">User Story</span>","Description":"When a User Story is assigned to a Feature, move this User Story to the Feature's project.","IsEnabled":false},{"Id":10,"Name":"Assign the <span style=\"color: #268213\">Feature's</span> Team to all its children","Description":"When a Feature is assigned to a Team, all the Feature's Bugs and User Stories are assigned to the same Team. Only the bugs directly linked to the Feature will be assigned.","IsEnabled":false},{"Id":11,"Name":"Assign a Project's Team to a <span style=\"color: #6296da\">User Story</span>","Description":"When a User Story is assigned to a Project, assign this User Story to this Project's Team. The Team will be assigned if it's the only Team assigned to the Project.","IsEnabled":false},{"Id":12,"Name":"Move a <span style=\"color: #268213\">Feature</span> to “Planned” state when its <span style=\"color: #5e5e5e\">Release</span> is set","Description":"Affects only the Features in the Initial state. The state should be marked as “Planned” in the workflow setup.","IsEnabled":false},{"Id":13,"Name":"Move a <span style=\"color: #6296da\">User Story</span> to “Planned” state when its Planned Start Date is set","Description":"Affects only the User Stories in the Initial state. The state should be marked as “Planned” in the workflow setup.","IsEnabled":false},{"Id":14,"Name":"Reschedule <span style=\"color: #268213\">Features</span>, <span style=\"color: #6296da\">User Stories</span> and <span style=\"color: #da5868\">Bugs</span> in a <span style=\"color: #5e5e5e\">Release</span>","Description":"When a Release is moved to a later Start date (e.g., it will start 7 days later), the Planned Start Dates and the Planned End Dates for Features, User Stories and Bugs are updated accordingly (increased by 7 days).","IsEnabled":false},{"Id":15,"Name":"Reschedule <span style=\"color: #6296da\">User Stories</span> and <span style=\"color: #da5868\">Bugs</span> in an <span style=\"color: #5e96c6\">Iteration</span>","Description":"When an Iteration is moved to a later Start Date (e.g., it will start 7 days later), the Planned Start Dates and the Planned End Dates for User Stories and Bugs are updated accordingly (increased by 7 days).","IsEnabled":false}]}